-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2021 年 03 月 01 日 18:14
-- 伺服器版本： 10.4.14-MariaDB
-- PHP 版本： 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `ju4t_final`
--

-- --------------------------------------------------------

--
-- 資料表結構 `social`
--

CREATE TABLE `social` (
  `sid` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `img` varchar(100) DEFAULT NULL,
  `name` varchar(100) NOT NULL,
  `verifyStatus` tinyint(1) NOT NULL DEFAULT 0,
  `watchNumber` int(11) NOT NULL DEFAULT 0,
  `heartNumber` int(11) NOT NULL DEFAULT 0,
  `revise_date` date NOT NULL DEFAULT current_timestamp(),
  `created_at` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `social`
--

INSERT INTO `social` (`sid`, `member_id`, `img`, `name`, `verifyStatus`, `watchNumber`, `heartNumber`, `revise_date`, `created_at`) VALUES
(6, 46, '1.jpg', '謝宗弘', 0, 13, 4, '2020-12-31', '2021-02-20'),
(7, 49, '2.jpg', '姚修竹', 0, 14, 6, '2020-12-31', '2021-02-20'),
(8, 6, '3.jpg', '李美惠', 0, 15, 6, '2020-12-31', '2021-02-20'),
(9, 27, '4.jpg', '呂賢原', 0, 16, 6, '2020-12-31', '2021-02-20'),
(10, 18, '5.png', '吳詩涵', 0, 17, 7, '2020-12-31', '2021-02-20'),
(11, 10, '6.jpg', '陳智堯', 0, 18, 8, '2020-12-31', '2021-02-20'),
(12, 45, '7.png', '陳仁豪', 0, 19, 9, '2020-12-31', '2021-02-20'),
(13, 40, '8.png', '謝家昇', 0, 20, 10, '2020-12-31', '2021-02-20'),
(14, 15, '9.png', '李佳燕', 0, 21, 11, '2020-12-31', '2021-02-20'),
(15, 7, '10.png', '張庭瑋', 0, 22, 12, '2020-12-31', '2021-02-20'),
(16, 31, '11.png', '涂樂惠', 0, 23, 13, '2020-12-31', '2021-02-20'),
(17, 22, '12.jpg', '蔡雅玲', 0, 24, 14, '2020-12-31', '2021-02-20'),
(18, 38, '13.png', '林志強', 0, 12, 15, '2020-12-31', '2021-02-20'),
(19, 12, '14.png', '蔡淑萍', 0, 13, 16, '2020-12-31', '2021-02-20'),
(20, 47, '15.png', '胡雅茹', 0, 14, 17, '2020-12-31', '2021-02-20'),
(21, 33, '16.jpg', '林素念', 0, 28, 18, '2020-12-31', '2021-02-20'),
(22, 24, '17.jpg', '居恆堯', 0, 29, 20, '2020-12-31', '2021-02-20'),
(23, 48, '18.jpg', '林至苓', 0, 30, 20, '2020-12-31', '2021-02-20'),
(24, 4, '19.jpg', '陳文旺', 0, 31, 21, '2020-12-31', '2021-02-20'),
(25, 20, '20.jpg', '彭雅慧', 0, 32, 34, '2020-12-31', '2021-02-20'),
(26, 32, '21.jpg', '黃靖廷', 0, 33, 23, '2020-12-31', '2021-02-20'),
(27, 30, '22.jpg', '陳登泉', 0, 34, 24, '2020-12-31', '2021-02-20'),
(28, 17, '23.png', '林政雯', 0, 35, 25, '2020-12-31', '2021-02-20'),
(29, 16, '24.jpg', '褚辛賢', 0, 11, 26, '2020-12-31', '2021-02-20'),
(30, 35, '25.jpg', '蔡仁苓', 0, 37, 27, '2020-12-31', '2021-02-20'),
(31, 50, '1.jpg', '林佳亞', 0, 38, 28, '2020-12-31', '2021-02-20'),
(32, 42, '2.jpg', '黃國偉', 0, 39, 29, '2020-12-31', '2021-02-20'),
(33, 25, '3.jpg', '陳偉俊', 0, 40, 30, '2020-12-31', '2021-02-20'),
(34, 41, '4.jpg', '黃美娟', 0, 41, 31, '2020-12-31', '2021-02-20'),
(35, 14, '5.png', '林志念', 0, 42, 32, '2020-12-31', '2021-02-20'),
(36, 43, '6.jpg', '謝建瑋', 0, 43, 33, '2020-12-31', '2021-02-20'),
(37, 21, '7.png', '陳淑敏', 0, 45, 35, '2020-12-31', '2021-02-20'),
(38, 28, '8.png', '陳彥青', 0, 45, 36, '2020-12-31', '2021-02-20'),
(39, 26, '9.png', '蘇家瑋', 0, 46, 37, '2020-12-31', '2021-02-20'),
(40, 39, '10.png', '謝家昇', 0, 47, 40, '2020-12-31', '2021-02-20'),
(41, 37, '11.png', '丁嘉玲', 0, 48, 39, '2020-12-31', '2021-02-20'),
(42, 3, '12.jpg', '劉光容', 0, 49, 40, '2020-12-31', '2021-02-20'),
(43, 9, '13.png', '林雅茹', 0, 51, 40, '2020-12-31', '2021-02-20'),
(44, 13, '14.png', '翁聖傑', 0, 51, 41, '2020-12-31', '2021-02-20'),
(45, 2, '15.png', '陳佳琪', 0, 52, 42, '2020-12-31', '2021-02-20'),
(46, 19, '16.jpg', '陳玉如', 0, 54, 50, '2020-12-31', '2021-02-20'),
(47, 36, '17.jpg', '沈淑婷', 0, 54, 47, '2020-12-31', '2021-02-20'),
(48, 23, '18.jpg', '林嘉仁', 0, 55, 46, '2020-12-31', '2021-02-20'),
(49, 5, '19.jpg', '陳佳霖', 0, 57, 46, '2020-12-31', '2021-02-20'),
(50, 51, '20.jpg', '楊智茵', 0, 58, 50, '2020-12-31', '2021-02-20'),
(51, 8, '21.jpg', '陳嘉玲', 0, 59, 51, '2020-12-31', '2021-02-20'),
(52, 29, '22.jpg', '張怡雯', 0, 66, 61, '2020-10-10', '2021-10-10'),
(53, 34, '23.png', 'sammy', 0, 62, 69, '2020-01-01', '2021-01-01'),
(54, 11, '24.jpg', 'Alison', 1, 11, 14, '2020-12-31', '2021-02-02'),
(55, 44, '25.jpg', 'carol', 0, 12, 4, '2020-12-31', '2021-02-20');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `social`
--
ALTER TABLE `social`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `social`
--
ALTER TABLE `social`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=265;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
